CSI API ETABS v1
cDCoItalianNTC2008C Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cDCoItalianNTC2008C
Public Interface cDCoItalianNTC2008C
Dim instance As cDCoItalianNTC2008C
public interface class cDCoItalianNTC2008C
type cDCoItalianNTC2008C =  interface end
The cDCoItalianNTC2008C type exposes the following members.
Methods
Name | Description
GetOverwrite
 Retrieves the value of a concrete design overwrite item.
GetPreference
 Retrieves the value of a concrete design preference item.
SetOverwrite
 Sets the value of a concrete design overwrite item.
SetPreference
 Sets the value of a concrete design preference item.
Top
See Also
Reference
ETABSv1 Namespace